---
kind: property
id: P:Autodesk.Revit.DB.Sketch.OwnerId
source: html/68849b64-a5c0-ad3c-b11a-59b80bfcc0da.htm
---
# Autodesk.Revit.DB.Sketch.OwnerId Property

Returns id of the sketch owner element or invalidElementId if sketch does not build a geometry.

## Syntax (C#)
```csharp
public ElementId OwnerId { get; }
```